; domain
(define (domain grid)
  (:requirements :strips)
  (:predicates
    ; grid cells and geometry
    (place ?x)
    (left ?x ?y)
    (below ?x ?y)

    ; shapes
    (objshape ?s)

    ; locked/open cells
    ; (locked cells can be later opened with key of matching lock shape)
    (open ?x)
    (locked ?x)
    (lock_shape ?x ?s)

    ; keys and shapes
    (key ?k)
    (at ?k ?x)
    (key_shape ?k ?s)

    ; robot
    (at_robot ?x)
    (holding ?k)
    (arm_empty)
  )

  ; move along unlocked cells
  (:action move_left
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (left ?nextpos ?curpos) 
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  (:action move_right
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (left ?curpos ?nextpos)
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  (:action move_up
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (below ?curpos ?nextpos)
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  (:action move_down
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (below ?nextpos ?curpos)
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  ; pickup/putdown keys
  (:action pickup
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos) (key ?key)
                       (at_robot ?curpos) (at ?key ?curpos) (arm_empty))
    :effect (and (holding ?key) (not (at ?key ?curpos)) (not (arm_empty))))

  (:action putdown
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos) (key ?key)
                       (at_robot ?curpos) (holding ?key))
    :effect (and (arm_empty) (at ?key ?curpos) (not (holding ?key))))

  ; unlock cells with right key
  (:action unlock_from_below
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (below ?curpos ?lockpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))

  (:action unlock_from_above
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (below ?lockpos ?curpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))

  (:action unlock_from_left
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (left ?curpos ?lockpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))

  (:action unlock_from_right
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (left ?lockpos ?curpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))
)

; problem
(define (problem grid_9room3_fpl_s3_seed25166_n0)
  (:domain grid)
  (:objects
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 p27 p28 p29 p30 p31 p32 p33 p34 p35 p36 p37 p38 p39 p40 p41 p42 p43 p44 p45 p46 p47 p48 p49 p50 p51 p52 p53 p54 p55 p56 p57 p58 p59 p60 p61 p62 p63 p64 p65 p66 p67 p68 p69 p70 p71 p72 p73 p74 p75 p76 p77 p78 p79 p80 p81 p82 p83 p84 p85 p86 p87 p88 p89
    shape0 shape1 shape2
    key0 key1 key2
  )
  (:init
    ; Object types
    (place p0) (place p1) (place p2) (place p3) (place p4) (place p5) (place p6) (place p7) (place p8) (place p9) (place p10) (place p11) (place p12) (place p13) (place p14) (place p15) (place p16) (place p17) (place p18) (place p19) (place p20) (place p21) (place p22) (place p23) (place p24) (place p25) (place p26) (place p27) (place p28) (place p29) (place p30) (place p31) (place p32) (place p33) (place p34) (place p35) (place p36) (place p37) (place p38) (place p39) (place p40) (place p41) (place p42) (place p43) (place p44) (place p45) (place p46) (place p47) (place p48) (place p49) (place p50) (place p51) (place p52) (place p53) (place p54) (place p55) (place p56) (place p57) (place p58) (place p59) (place p60) (place p61) (place p62) (place p63) (place p64) (place p65) (place p66) (place p67) (place p68) (place p69) (place p70) (place p71) (place p72) (place p73) (place p74) (place p75) (place p76) (place p77) (place p78) (place p79) (place p80) (place p81) (place p82) (place p83) (place p84) (place p85) (place p86) (place p87) (place p88) (place p89)
    (objshape shape0) (objshape shape1) (objshape shape2)
    (key key0) (key key1) (key key2)
    ; Open/locked cells
    (open p0) (open p1) (open p2) (open p4) (open p5) (open p6) (open p7) (open p8) (open p9) (open p10) (open p11) (open p12) (open p13) (open p14) (open p15) (open p17) (open p18) (open p19) (open p20) (open p21) (open p22) (open p23) (open p24) (open p25) (open p26) (open p27) (open p28) (open p31) (open p32) (open p33) (open p35) (open p36) (open p37) (open p38) (open p39) (open p40) (open p41) (open p42) (open p43) (open p44) (open p45) (open p46) (open p48) (open p49) (open p50) (open p51) (open p52) (open p53) (open p54) (open p55) (open p56) (open p57) (open p58) (open p59) (open p61) (open p62) (open p63) (open p64) (open p65) (open p66) (open p68) (open p69) (open p70) (open p71) (open p72) (open p73) (open p74) (open p75) (open p76) (open p77) (open p78) (open p79) (open p80) (open p81) (open p82) (open p84) (open p85) (open p86) (open p87) (open p88) (open p89)
    (locked p3) (locked p16) (locked p29) (locked p30) (locked p34) (locked p47) (locked p60) (locked p67) (locked p83)
    ; Left/below relations
    (left p1 p0)
    (left p2 p1)
    (left p3 p2)
    (left p4 p3)
    (left p5 p4)
    (left p6 p5)
    (left p8 p7)
    (left p9 p8)
    (left p11 p10)
    (left p12 p11)
    (left p14 p13)
    (left p15 p14)
    (left p16 p15)
    (left p17 p16)
    (left p18 p17)
    (left p19 p18)
    (left p21 p20)
    (left p22 p21)
    (left p24 p23)
    (left p25 p24)
    (left p27 p26)
    (left p28 p27)
    (left p32 p31)
    (left p33 p32)
    (left p34 p33)
    (left p35 p34)
    (left p36 p35)
    (left p37 p36)
    (left p39 p38)
    (left p40 p39)
    (left p42 p41)
    (left p43 p42)
    (left p45 p44)
    (left p46 p45)
    (left p47 p46)
    (left p48 p47)
    (left p49 p48)
    (left p50 p49)
    (left p52 p51)
    (left p53 p52)
    (left p55 p54)
    (left p56 p55)
    (left p58 p57)
    (left p59 p58)
    (left p62 p61)
    (left p63 p62)
    (left p65 p64)
    (left p66 p65)
    (left p67 p66)
    (left p68 p67)
    (left p69 p68)
    (left p70 p69)
    (left p72 p71)
    (left p73 p72)
    (left p75 p74)
    (left p76 p75)
    (left p78 p77)
    (left p79 p78)
    (left p81 p80)
    (left p82 p81)
    (left p83 p82)
    (left p84 p83)
    (left p85 p84)
    (left p86 p85)
    (left p88 p87)
    (left p89 p88)
    (below p0 p10)
    (below p1 p11)
    (below p2 p12)
    (below p4 p13)
    (below p5 p14)
    (below p6 p15)
    (below p7 p17)
    (below p8 p18)
    (below p9 p19)
    (below p10 p20)
    (below p11 p21)
    (below p12 p22)
    (below p13 p23)
    (below p14 p24)
    (below p15 p25)
    (below p17 p26)
    (below p18 p27)
    (below p19 p28)
    (below p21 p29)
    (below p26 p30)
    (below p29 p32)
    (below p30 p38)
    (below p31 p41)
    (below p32 p42)
    (below p33 p43)
    (below p35 p44)
    (below p36 p45)
    (below p37 p46)
    (below p38 p48)
    (below p39 p49)
    (below p40 p50)
    (below p41 p51)
    (below p42 p52)
    (below p43 p53)
    (below p44 p54)
    (below p45 p55)
    (below p46 p56)
    (below p48 p57)
    (below p49 p58)
    (below p50 p59)
    (below p53 p60)
    (below p60 p63)
    (below p61 p71)
    (below p62 p72)
    (below p63 p73)
    (below p64 p74)
    (below p65 p75)
    (below p66 p76)
    (below p68 p77)
    (below p69 p78)
    (below p70 p79)
    (below p71 p80)
    (below p72 p81)
    (below p73 p82)
    (below p74 p84)
    (below p75 p85)
    (below p76 p86)
    (below p77 p87)
    (below p78 p88)
    (below p79 p89)
    ; Lock and key shapes
    (lock_shape p16 shape1)
    (lock_shape p34 shape1)
    (lock_shape p60 shape0)
    (lock_shape p83 shape2)
    (lock_shape p3 shape0)
    (lock_shape p30 shape0)
    (lock_shape p47 shape1)
    (lock_shape p29 shape0)
    (lock_shape p67 shape0)
    (key_shape key0 shape0)
    (key_shape key1 shape1)
    (key_shape key2 shape2)
    ; Key placement
    (at key0 p61)
    (at key1 p69)
    (at key2 p86)
    ; Robot placement
    (at_robot p64)
    (arm_empty)
  )
  (:goal (at_robot p44))
)

; plan
1. (move_left p64 p65)
   deleted: (at_robot p64)
   added: (at_robot p65)
   goals met: 0 of 1
2. (move_left p65 p66)
   deleted: (at_robot p65)
   added: (at_robot p66)
   goals met: 0 of 1
3. (move_up p66 p76)
   deleted: (at_robot p66)
   added: (at_robot p76)
   goals met: 0 of 1
4. (move_up p76 p86)
   deleted: (at_robot p76)
   added: (at_robot p86)
   goals met: 0 of 1
5. (pickup p86 key2)
   deleted: (at key2 p86) (arm_empty)
   added: (holding key2)
   goals met: 0 of 1
6. (move_right p86 p85)
   deleted: (at_robot p86)
   added: (at_robot p85)
   goals met: 0 of 1
7. (move_right p85 p84)
   deleted: (at_robot p85)
   added: (at_robot p84)
   goals met: 0 of 1
8. (unlock_from_left p84 p83 key2 shape2)
   deleted: (locked p83)
   added: (open p83)
   goals met: 0 of 1
9. (move_right p84 p83)
   deleted: (at_robot p84)
   added: (at_robot p83)
   goals met: 0 of 1
10. (move_right p83 p82)
   deleted: (at_robot p83)
   added: (at_robot p82)
   goals met: 0 of 1
11. (move_right p82 p81)
   deleted: (at_robot p82)
   added: (at_robot p81)
   goals met: 0 of 1
12. (move_right p81 p80)
   deleted: (at_robot p81)
   added: (at_robot p80)
   goals met: 0 of 1
13. (move_down p80 p71)
   deleted: (at_robot p80)
   added: (at_robot p71)
   goals met: 0 of 1
14. (move_down p71 p61)
   deleted: (at_robot p71)
   added: (at_robot p61)
   goals met: 0 of 1
15. (putdown p61 key2)
   deleted: (holding key2)
   added: (arm_empty) (at key2 p61)
   goals met: 0 of 1
16. (pickup p61 key0)
   deleted: (at key0 p61) (arm_empty)
   added: (holding key0)
   goals met: 0 of 1
17. (move_left p61 p62)
   deleted: (at_robot p61)
   added: (at_robot p62)
   goals met: 0 of 1
18. (move_left p62 p63)
   deleted: (at_robot p62)
   added: (at_robot p63)
   goals met: 0 of 1
19. (unlock_from_above p63 p60 key0 shape0)
   deleted: (locked p60)
   added: (open p60)
   goals met: 0 of 1
20. (move_up p63 p73)
   deleted: (at_robot p63)
   added: (at_robot p73)
   goals met: 0 of 1
21. (move_up p73 p82)
   deleted: (at_robot p73)
   added: (at_robot p82)
   goals met: 0 of 1
22. (move_left p82 p83)
   deleted: (at_robot p82)
   added: (at_robot p83)
   goals met: 0 of 1
23. (move_left p83 p84)
   deleted: (at_robot p83)
   added: (at_robot p84)
   goals met: 0 of 1
24. (move_left p84 p85)
   deleted: (at_robot p84)
   added: (at_robot p85)
   goals met: 0 of 1
25. (move_left p85 p86)
   deleted: (at_robot p85)
   added: (at_robot p86)
   goals met: 0 of 1
26. (move_down p86 p76)
   deleted: (at_robot p86)
   added: (at_robot p76)
   goals met: 0 of 1
27. (move_down p76 p66)
   deleted: (at_robot p76)
   added: (at_robot p66)
   goals met: 0 of 1
28. (unlock_from_right p66 p67 key0 shape0)
   deleted: (locked p67)
   added: (open p67)
   goals met: 0 of 1
29. (move_left p66 p67)
   deleted: (at_robot p66)
   added: (at_robot p67)
   goals met: 0 of 1
30. (move_left p67 p68)
   deleted: (at_robot p67)
   added: (at_robot p68)
   goals met: 0 of 1
31. (move_left p68 p69)
   deleted: (at_robot p68)
   added: (at_robot p69)
   goals met: 0 of 1
32. (putdown p69 key0)
   deleted: (holding key0)
   added: (arm_empty) (at key0 p69)
   goals met: 0 of 1
33. (pickup p69 key1)
   deleted: (at key1 p69) (arm_empty)
   added: (holding key1)
   goals met: 0 of 1
34. (move_right p69 p68)
   deleted: (at_robot p69)
   added: (at_robot p68)
   goals met: 0 of 1
35. (move_right p68 p67)
   deleted: (at_robot p68)
   added: (at_robot p67)
   goals met: 0 of 1
36. (move_right p67 p66)
   deleted: (at_robot p67)
   added: (at_robot p66)
   goals met: 0 of 1
37. (move_right p66 p65)
   deleted: (at_robot p66)
   added: (at_robot p65)
   goals met: 0 of 1
38. (move_right p65 p64)
   deleted: (at_robot p65)
   added: (at_robot p64)
   goals met: 0 of 1
39. (move_up p64 p74)
   deleted: (at_robot p64)
   added: (at_robot p74)
   goals met: 0 of 1
40. (move_up p74 p84)
   deleted: (at_robot p74)
   added: (at_robot p84)
   goals met: 0 of 1
41. (move_right p84 p83)
   deleted: (at_robot p84)
   added: (at_robot p83)
   goals met: 0 of 1
42. (move_right p83 p82)
   deleted: (at_robot p83)
   added: (at_robot p82)
   goals met: 0 of 1
43. (move_down p82 p73)
   deleted: (at_robot p82)
   added: (at_robot p73)
   goals met: 0 of 1
44. (move_down p73 p63)
   deleted: (at_robot p73)
   added: (at_robot p63)
   goals met: 0 of 1
45. (move_down p63 p60)
   deleted: (at_robot p63)
   added: (at_robot p60)
   goals met: 0 of 1
46. (move_down p60 p53)
   deleted: (at_robot p60)
   added: (at_robot p53)
   goals met: 0 of 1
47. (move_down p53 p43)
   deleted: (at_robot p53)
   added: (at_robot p43)
   goals met: 0 of 1
48. (move_down p43 p33)
   deleted: (at_robot p43)
   added: (at_robot p33)
   goals met: 0 of 1
49. (unlock_from_right p33 p34 key1 shape1)
   deleted: (locked p34)
   added: (open p34)
   goals met: 0 of 1
50. (move_left p33 p34)
   deleted: (at_robot p33)
   added: (at_robot p34)
   goals met: 0 of 1
51. (move_left p34 p35)
   deleted: (at_robot p34)
   added: (at_robot p35)
   goals met: 0 of 1
52. (move_up p35 p44)
   deleted: (at_robot p35)
   added: (at_robot p44)
   goals met: 1 of 1
